# Pandas

In [4]:
import pandas as pd
import pandera as pa

## Pandas Series

In [35]:
# pandas Series using list
s1 : pd.Series = pd.Series([1, 2, 3,4,5])
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [36]:
# Series using Dictionary
s1 : pd.Series = pd.Series(
    {
        'name':'Sarmad',
        'email':'sarmad@gmail.com',
        'age':19
     }
    )

s1

name               Sarmad
email    sarmad@gmail.com
age                    19
dtype: object

In [37]:
# Series using list
values : list[int] = [1, 2, 3, 4]
index : list[str] = ['a', 'b', 'c','d']

s1 : pd.Series = pd.Series(values,index=index)
s1

a    1
b    2
c    3
d    4
dtype: int64

In [38]:
values: list[str] = list('ABCDEFGH')
series : pd.Series = pd.Series(values,index=[1,2,3,4,5,6,7,8])

series

1    A
2    B
3    C
4    D
5    E
6    F
7    G
8    H
dtype: object

In [39]:
values : list[int] = [1, 2, 3, 4]
index : list[list[str]] = [['a', 'b', 'c','d'],['e','f','g','h']]

s1 : pd.Series = pd.Series(values,index=index,name="Student Data")
s1

# The name can be anything.

a  e    1
b  f    2
c  g    3
d  h    4
Name: Student Data, dtype: int64

In [40]:
# Series using python sets
series: pd.Series = pd.Series(('Sarmad','sarmad@gmail.com',19))
series

0              Sarmad
1    sarmad@gmail.com
2                  19
dtype: object

## DataFrame

In [41]:
# create a dictionary with the three series
data = {
        'Student Id': pd.Series([1, 2, 3, 4, 5], name="Student Id"),
        'Student Score': pd.Series([10, 20, 30, 40, 50], name="Student Score"),
        'Student name': pd.Series(["Sarmad", "Hammad", 'Ali', 'Akmal', 'Jawad'], name="Student name")
        }

# create a dataframe from the dictionary
df :pd.DataFrame = pd.DataFrame(data)

# display the dataframe in a Jupyter notebook
df

   Student Id  Student Score Student name
0           1             10       Sarmad
1           2             20       Hammad
2           3             30          Ali
3           4             40        Akmal
4           5             50        Jawad

In [42]:
s1 : pd.Series = pd.Series([1, 2, 3,4,5],name="Student Id")
s2 : pd.Series = pd.Series([10, 20, 30,40,50],name="Student Score")
s3 : pd.Series = pd.Series(["Sarmad","Hammad",'Ali','Akmal','Jawad'],name="Student name")

df1 : pd.DataFrame = pd.DataFrame({"Student Id":s1,"Score":s2,"Student Name":s3})

df1

   Student Id  Score Student Name
0           1     10       Sarmad
1           2     20       Hammad
2           3     30          Ali
3           4     40        Akmal
4           5     50        Jawad

In [3]:
df: pd.DataFrame = pd.read_json("https://www.w3schools.com/python/pandas/data.js")
df

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.4
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [ ]:
# data to validate
df = pd.DataFrame({
    "column1": [1, 4, 0, 10, 9],
    "column2": [-1.3, -1.4, -2.9, -10.1, -20.4],
    "column3": ["value_1", "value_2", "value_3", "value_2", "value_1"],
})

# define schema
schema = pa.DataFrameSchema({
    "column1": pa.Column(int, checks=pa.Check.le(10)),
    "column2": pa.Column(float, checks=pa.Check.lt(-1.2)),
    "column3": pa.Column(str, checks=[
        pa.Check.str_startswith("value_"),
        # define custom checks as functions that take a series as input and
        # outputs a boolean or boolean Series
        pa.Check(lambda s: s.str.split("_", expand=True).shape[1] == 2)
    ]),
})

validated_df = schema(df)
print(validated_df)

   column1  column2  column3
0        1     -1.3  value_5
1        4     -1.4  value_2
2        0     -2.9  value_3
3       10    -10.1  value_2
4        9    -20.4  value_1

In [ ]:
data : list[list[int]] = [
    [1,2,3],
    [4,5,6],
    [7,8,9]
    ]

table: pd.DataFrame = pd.DataFrame(data,columns=['A','B','C'],index=[1,2,3])
table

   A  B  C
1  1  2  3
2  4  5  6
3  7  8  9

In [ ]:
table.keys

<bound method NDFrame.keys of    A  B  C
1  1  2  3
2  4  5  6
3  7  8  9>

In [ ]:
table.columns

Index(['A', 'B', 'C'], dtype='object')

In [ ]:
table.index

Index([1, 2, 3], dtype='int64')

In [ ]:
table.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]], dtype=int64)

In [50]:
import numpy as np
from nptyping import NDArray, Shape, Int64

arr : NDArray[Shape['10'],Int64] = np.arange(8*10).reshape(8,10)

table: pd.DataFrame = pd.DataFrame(arr, columns=list('ABCDEFGHIJ'))

table

    A   B   C   D   E   F   G   H   I   J
0   0   1   2   3   4   5   6   7   8   9
1  10  11  12  13  14  15  16  17  18  19
2  20  21  22  23  24  25  26  27  28  29
3  30  31  32  33  34  35  36  37  38  39
4  40  41  42  43  44  45  46  47  48  49
5  50  51  52  53  54  55  56  57  58  59
6  60  61  62  63  64  65  66  67  68  69
7  70  71  72  73  74  75  76  77  78  79

## Regex

In [45]:
x : str = """
21:41:45 From Altaf Hussain to Everyone:
	PIAIC-173738
21:41:51 From Hamza to Everyone:
	PIAIC-201785
21:41:52 From jhon wick to Everyone:
	piaic 223880
21:41:54 From Hina Zargham to Everyone:
	PIAIC101499
21:41:54 From Hatif Humayun to Everyone:
	PIAIC-52822
21:41:54 From Ahmed Siddiqui to Everyone:
	PIAIC123456
21:41:56 From Arif Najmi to Everyone:
	125657
21:42:00 From Rehan Baig to Everyone:
	PIAIC73919
21:42:00 From STONE to Everyone:
	ZAM - 786
21:42:01 From M. Waheed Iqbal (PIAIC_126369) to Everyone:
	PIAIC_126369
21:42:03 From Anonymous to Everyone:
	PIAIC210905
21:42:06 From ABDUL KHALIQ to Everyone:
	PIAIC-604031
21:42:11 From Arshad Siddiqui to Everyone:
	PIAIC120702
21:42:13 From Ali Zar FSD to Everyone:
	PIaic 223972
21:42:13 From Azfar Suhail to Everyone:
	PIAIC218333
21:42:14 From Kamran Ahmed to Everyone:
	PIAIC139495
21:42:18 From Ahmed to Everyone:
	216511
21:42:20 From Ayesha Arshad to Everyone:
	PIAIC-225620
21:42:25 From Kamal Hassan to Everyone:
	PIAIC58320
21:42:29 From Ahmed to Everyone:
	PIAIC-2165111
"""

import re

patterns : str = r'''
(\d{2}:\d{2}:\d{2}) From (.*) to Everyone:
	(PIAIC-? ?\d{5,6})
'''

data : list[list[str]] = re.findall(patterns, x)

data

[('21:41:45', 'Altaf Hussain', 'PIAIC-173738'),
 ('21:41:54', 'Hina Zargham', 'PIAIC101499'),
 ('21:41:54', 'Ahmed Siddiqui', 'PIAIC123456'),
 ('21:42:00', 'Rehan Baig', 'PIAIC73919'),
 ('21:42:03', 'Anonymous', 'PIAIC210905'),
 ('21:42:11', 'Arshad Siddiqui', 'PIAIC120702'),
 ('21:42:13', 'Azfar Suhail', 'PIAIC218333'),
 ('21:42:20', 'Ayesha Arshad', 'PIAIC-225620')]

In [46]:
df: pd.DataFrame = pd.DataFrame(data, columns=["Time", "Name", "Roll Number"])

df

       Time             Name   Roll Number
0  21:41:45    Altaf Hussain  PIAIC-173738
1  21:41:54     Hina Zargham   PIAIC101499
2  21:41:54   Ahmed Siddiqui   PIAIC123456
3  21:42:00       Rehan Baig    PIAIC73919
4  21:42:03        Anonymous   PIAIC210905
5  21:42:11  Arshad Siddiqui   PIAIC120702
6  21:42:13     Azfar Suhail   PIAIC218333
7  21:42:20    Ayesha Arshad  PIAIC-225620

In [48]:
# Concatenate

name : pd.Series = pd.Series(['Sarmad','Hammad','Akmal','Nawaz','Babar'],name='Name')
email : pd.Series = pd.Series(
    ['sarmad@gmail.com','hammad@gmail.com','Akmal@gmail.com','Nawaz@gmail.com','Babar@gmail.com']
    ,name='Email'
    )
major : pd.Series = pd.Series(['BSSE','BSCS','BSIT','BSCS','BSAI'],name='Major')

table: pd.DataFrame = pd.concat([name,email,major],axis=1)

table

     Name             Email Major
0  Sarmad  sarmad@gmail.com  BSSE
1  Hammad  hammad@gmail.com  BSCS
2   Akmal   Akmal@gmail.com  BSIT
3   Nawaz   Nawaz@gmail.com  BSCS
4   Babar   Babar@gmail.com  BSAI

In [ ]:
df: pd.DataFrame = pd.read_json("https://www.w3schools.com/python/pandas/data.js")
df

## Slicing

In [58]:
s1 : pd.Series = pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
display(s1.iloc[1:4]) # index location (numbers) same as numpy

b    2
c    3
d    4
dtype: int64

In [62]:
s1: pd.Series = pd.Series([1, 2, 3, 4, 5], index=["a", "b", "c", "d", "e"])
display(s1.loc['a':'d'])  # index location (label) end included

a    1
b    2
c    3
d    4
dtype: int64

In [63]:
s1: pd.Series = pd.Series([1, 2, 3, 4, 5], index=["a", "b", "c", "d", "e"])
display(s1.iat[1])  # index location (numbers) extract one cell value and it can be updated.

2

In [66]:
s1: pd.Series = pd.Series([1, 2, 3, 4, 5], index=["a", "b", "c", "d", "e"])
display(
    s1.at['d']
)

4